In [1]:
import pandas as pd
import numpy as np

In [2]:
## ??pd.DataFrame.groupby()

In [3]:
df=pd.DataFrame({'a1':list('abcd'*25),
                 'a2':list('xy'*25 +'yz'*25),
                 'v1':np.random.rand(100),
                 'v2':np.random.rand(100)
                 })

df.head()

  a1 a2        v1        v2
0  a  x  0.937789  0.639212
1  b  y  0.676278  0.129479
2  c  x  0.801385  0.003438
3  d  y  0.954189  0.356128
4  a  x  0.889917  0.812153

In [4]:
list('abcd'*25)

['a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd',
 'a',
 'b',
 'c',
 'd']

# Group By

In [5]:
df.groupby('a1').mean() # grouping by column a1 and finding the mean of v1 and v2

          v1        v2
a1
a   0.541304  0.576948
b   0.480324  0.514445
c   0.462701  0.456054
d   0.526268  0.468201

In [6]:
df.groupby('a2').sum()

           v1         v2
a2
x   14.638842  12.300356
y   23.500419  24.563958
z   12.125654  13.526887

In [7]:
df.groupby(['a1', 'a2']).mean() # grouping by multiple columns

             v1        v2
a1 a2
a  x   0.722617  0.611510
   y   0.344881  0.539506
b  y   0.490242  0.443238
   z   0.469579  0.591585
c  x   0.437068  0.362561
   y   0.486362  0.542356
d  y   0.555499  0.439764
   z   0.499285  0.494451

In [8]:
df.groupby(['a1', 'a2']).agg(['min', 'mean', 'max']) # grouping and applying multiple conditions

             v1                            v2
            min      mean       max       min      mean       max
a1 a2
a  x   0.000126  0.722617  0.986695  0.152023  0.611510  0.999383
   y   0.021282  0.344881  0.981510  0.115561  0.539506  0.998697
b  y   0.090754  0.490242  0.920750  0.109493  0.443238  0.974860
   z   0.035796  0.469579  0.949610  0.090967  0.591585  0.880941
c  x   0.052454  0.437068  0.947869  0.003438  0.362561  0.688189
   y   0.009931  0.486362  0.944288  0.016971  0.542356  0.880055
d  y   0.053121  0.555499  0.954189  0.040530  0.439764  0.832063
   z   0.046281  0.499285  0.999227  0.043584  0.494451  0.936839

In [9]:
df.groupby(['a1', 'a2']).agg(['min', 'mean', 'max'])['v1'] # as its a dataframe retrieving only the 1st column

            min      mean       max
a1 a2
a  x   0.000126  0.722617  0.986695
   y   0.021282  0.344881  0.981510
b  y   0.090754  0.490242  0.920750
   z   0.035796  0.469579  0.949610
c  x   0.052454  0.437068  0.947869
   y   0.009931  0.486362  0.944288
d  y   0.053121  0.555499  0.954189
   z   0.046281  0.499285  0.999227

# Joins

pd.merge(df1, df2, 
     how='left', 
     on = 'key',
     left_on=None,
     right_on=None,
     sort=True,
     copy=True)

In [10]:
df1 = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1':np.random.randn(7)})

df2 = pd.DataFrame({'key':['a', 'b', 'd', 'b'],
                   'data2':np.random.randn(4)})

df3 = pd.DataFrame({'1key':['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data3':np.random.randn(7)})

df4 = pd.DataFrame({'rkey':['a', 'b', 'd'],
                   'data4' :np.random.randn(3)})

In [11]:
df1.shape

(7, 2)

In [12]:
df1

      data1 key
0  0.375590   b
1  0.390499   b
2  0.320828   a
3 -0.369207   c
4  0.792436   a
5  0.281559   a
6  0.448998   b

In [13]:
df2

      data2 key
0  1.385361   a
1  1.692918   b
2  1.490346   d
3  1.515857   b

In [14]:
df3

  1key     data3
0    b  0.358222
1    b  0.090089
2    a  0.340309
3    c -0.871466
4    a  0.425047
5    a  0.547838
6    b  1.109652

In [15]:
df4

      data4 rkey
0  0.453042    a
1 -0.474925    b
2 -0.098596    d

In [16]:
pd.merge(df1, df2) # by default it joins it on inner join

      data1 key     data2
0  0.375590   b  1.692918
1  0.375590   b  1.515857
2  0.390499   b  1.692918
3  0.390499   b  1.515857
4  0.448998   b  1.692918
5  0.448998   b  1.515857
6  0.320828   a  1.385361
7  0.792436   a  1.385361
8  0.281559   a  1.385361

In [17]:
pd.merge(df3, df4, left_on='1key', right_on='rkey') #both tables have 'a' and 'b' as common entity so inner join is applied.
# left_on and right_on keys are used when we know both the column values are same but headers are named differently

  1key     data3     data4 rkey
0    b  0.358222 -0.474925    b
1    b  0.090089 -0.474925    b
2    b  1.109652 -0.474925    b
3    a  0.340309  0.453042    a
4    a  0.425047  0.453042    a
5    a  0.547838  0.453042    a

In [18]:
pd.merge(df1, df2, how='outer') # other than inner joins all other joins need to be mentioned
# all the combinations are met and where ever its not then it displays NaN

       data1 key     data2
0   0.375590   b  1.692918
1   0.375590   b  1.515857
2   0.390499   b  1.692918
3   0.390499   b  1.515857
4   0.448998   b  1.692918
5   0.448998   b  1.515857
6   0.320828   a  1.385361
7   0.792436   a  1.385361
8   0.281559   a  1.385361
9  -0.369207   c       NaN
10       NaN   d  1.490346

In [19]:
pd.merge(df1, df2, how='left')

      data1 key     data2
0  0.375590   b  1.692918
1  0.375590   b  1.515857
2  0.390499   b  1.692918
3  0.390499   b  1.515857
4  0.320828   a  1.385361
5 -0.369207   c       NaN
6  0.792436   a  1.385361
7  0.281559   a  1.385361
8  0.448998   b  1.692918
9  0.448998   b  1.515857

# Concat

In [20]:
s1=pd.Series(np.random.randn(3), index=list('abc'))
s2=pd.Series(np.random.randn(4), index=list('defg'))
s3=pd.Series(np.random.randn(2), index=list('hi'))

In [21]:
s1

a    0.604713
b   -1.617974
c    0.707963
dtype: float64

In [22]:
s2

d    0.741201
e   -1.063684
f   -1.274234
g    0.609912
dtype: float64

In [23]:
s3

h   -0.600084
i   -0.033488
dtype: float64

In [24]:
pd.concat([s1, s2, s3], axis=1) # attaching 3 of them side by side column wise

          0         1         2
a  0.604713       NaN       NaN
b -1.617974       NaN       NaN
c  0.707963       NaN       NaN
d       NaN  0.741201       NaN
e       NaN -1.063684       NaN
f       NaN -1.274234       NaN
g       NaN  0.609912       NaN
h       NaN       NaN -0.600084
i       NaN       NaN -0.033488

In [25]:
pd.concat([s1, s2, s3], axis=1, keys=['ones', 'two', 'three']) # renaming columns

       ones       two     three
a  0.604713       NaN       NaN
b -1.617974       NaN       NaN
c  0.707963       NaN       NaN
d       NaN  0.741201       NaN
e       NaN -1.063684       NaN
f       NaN -1.274234       NaN
g       NaN  0.609912       NaN
h       NaN       NaN -0.600084
i       NaN       NaN -0.033488

In [26]:
pd.concat([s1, s2, s3], axis=0) # attaching row wise.

a    0.604713
b   -1.617974
c    0.707963
d    0.741201
e   -1.063684
f   -1.274234
g    0.609912
h   -0.600084
i   -0.033488
dtype: float64

# Reshaping 

1. Long Form - (stack - pivots - columns to rows)
2. Wide Form - (unstack - rows to columns)

In [27]:
df = pd.DataFrame(np.random.randn(4,2), index=[list('AB'*2), list('CDEF')],columns=list('XY'))
df

            X         Y
A C  0.118459  1.187162
B D -0.407743 -0.630644
A E -0.492905 -0.564202
B F  1.118888  1.174571

In [28]:
df.index.names=['one', 'two']
df

                X         Y
one two
A   C    0.118459  1.187162
B   D   -0.407743 -0.630644
A   E   -0.492905 -0.564202
B   F    1.118888  1.174571

In [29]:
#converting wide form to long form
wl=df.stack()
wl

one  two
A    C    X    0.118459
          Y    1.187162
B    D    X   -0.407743
          Y   -0.630644
A    E    X   -0.492905
          Y   -0.564202
B    F    X    1.118888
          Y    1.174571
dtype: float64

In [30]:
#long form to wide form
lw=wl.unstack()
lw

                X         Y
one two
A   C    0.118459  1.187162
    E   -0.492905 -0.564202
B   D   -0.407743 -0.630644
    F    1.118888  1.174571

# Pivoting

In [31]:
df=pd.DataFrame({'date':(list(pd.date_range('2000-01-03', '2000-01-05'))*4), 'item':(list('ABCD'*3)), 
                 'status':(np.random.randn(12))})
df

         date item    status
0  2000-01-03    A  0.436633
1  2000-01-04    B -0.758330
2  2000-01-05    C -1.086784
3  2000-01-03    D  1.459062
4  2000-01-04    A  0.069276
5  2000-01-05    B  0.981245
6  2000-01-03    C  0.318357
7  2000-01-04    D  1.020754
8  2000-01-05    A  0.240399
9  2000-01-03    B  0.022283
10 2000-01-04    C  0.693949
11 2000-01-05    D -0.681343

In [32]:
df.pivot(index='date', columns='item', values='status')

item               A         B         C         D
date
2000-01-03  0.436633  0.022283  0.318357  1.459062
2000-01-04  0.069276 -0.758330  0.693949  1.020754
2000-01-05  0.240399  0.981245 -1.086784 -0.681343

In [33]:
df.pivot_table(index='date', columns='item', values='status', aggfunc='mean')

item               A         B         C         D
date
2000-01-03  0.436633  0.022283  0.318357  1.459062
2000-01-04  0.069276 -0.758330  0.693949  1.020754
2000-01-05  0.240399  0.981245 -1.086784 -0.681343

Difference between pivot and pivot tables is that we can use __aggregate functions__ in pivot tables where as we can not in pivot.